bigwudan/esp32_3c/components/Radio/src/sx126x-board.c
/*
  ______                              _
 / _____)             _              | |
( (____  _____ ____ _| |_ _____  ____| |__
 \____ \| ___ |    (_   _) ___ |/ ___)  _ \
 _____) ) ____| | | || |_| ____( (___| | | |
(______/|_____)_|_|_| \__)_____)\____)_| |_|
    (C)2013 Semtech

Description: SX126x driver specific target board functions implementation

License: Revised BSD License, see LICENSE.TXT file include in the project

Maintainer: Miguel Luis and Gregory Cristian
*/
#if 0
#include "stm32f0xx.h"
#include "delay.h"
#include "gpio.h"
#include "spi.h"
#endif
#include "radio.h"
#include "sx126x.h"
#include "sx126x-board.h"


void SX126xReset( void )
{
#if 0    
    HAL_Delay_nMS( 10 );
    GPIO_WriteBit( RADIO_nRESET_PORT, RADIO_nRESET_PIN,Bit_RESET);
    HAL_Delay_nMS( 20 );
    GPIO_WriteBit( RADIO_nRESET_PORT, RADIO_nRESET_PIN,Bit_SET);
    HAL_Delay_nMS( 10 );
#endif    
}

void SX126xWaitOnBusy( void )
{
#if 0    
   while(GPIO_ReadInputDataBit(RADIO_BUSY_PORT,RADIO_BUSY_PIN)==Bit_SET);
#endif   
}


void SX126xWakeup( void )
{
#if 0    
    GPIO_WriteBit( RADIO_NSS_PORT, RADIO_NSS_PIN,Bit_RESET);
   
    SpiInOut(RADIO_GET_STATUS);
    SpiInOut(0);
    
    GPIO_WriteBit( RADIO_NSS_PORT, RADIO_NSS_PIN,Bit_SET);

    // Wait for chip to be ready.
    SX126xWaitOnBusy( );
#endif    
}

void SX126xWriteCommand( RadioCommands_t command, uint8_t *buffer, uint16_t size )
{
#if 0
    SX126xCheckDeviceReady( );

    GPIO_WriteBit( RADIO_NSS_PORT, RADIO_NSS_PIN,Bit_RESET);

    SpiInOut(( uint8_t )command );

    for( uint16_t i = 0; i < size; i++ )
    {
        SpiInOut(buffer[i] );
    }

    GPIO_WriteBit( RADIO_NSS_PORT, RADIO_NSS_PIN,Bit_SET);
    
    if( command != RADIO_SET_SLEEP )
    {
        SX126xWaitOnBusy( );
    }
#endif    
}

void SX126xReadCommand( RadioCommands_t command, uint8_t *buffer, uint16_t size )
{
#if 0    
    SX126xCheckDeviceReady( );

    GPIO_WriteBit( RADIO_NSS_PORT, RADIO_NSS_PIN,Bit_RESET);

    SpiInOut(( uint8_t )command );
    SpiInOut(0x00 );
    for( uint16_t i = 0; i < size; i++ )
    {
        buffer[i] = SpiInOut(0 );
    }

    GPIO_WriteBit( RADIO_NSS_PORT, RADIO_NSS_PIN,Bit_SET);

    SX126xWaitOnBusy( );
#endif    
}

void SX126xWriteRegisters( uint16_t address, uint8_t *buffer, uint16_t size )
{
#if 0    
    SX126xCheckDeviceReady( );

    GPIO_WriteBit( RADIO_NSS_PORT, RADIO_NSS_PIN,Bit_RESET);
    
    SpiInOut(RADIO_WRITE_REGISTER );
    SpiInOut(( address & 0xFF00 ) >> 8 );
    SpiInOut( address & 0x00FF );
    
    for( uint16_t i = 0; i < size; i++ )
    {
        SpiInOut(buffer[i] );
    }


    GPIO_WriteBit( RADIO_NSS_PORT, RADIO_NSS_PIN,Bit_SET);

    SX126xWaitOnBusy( );
#endif    
}

void SX126xWriteRegister( uint16_t address, uint8_t value )
{
    SX126xWriteRegisters( address, &value, 1 );
}

void SX126xReadRegisters( uint16_t address, uint8_t *buffer, uint16_t size )
{
#if 0    
    SX126xCheckDeviceReady( );

    GPIO_WriteBit( RADIO_NSS_PORT, RADIO_NSS_PIN,Bit_RESET);

    SpiInOut(RADIO_READ_REGISTER );
    SpiInOut(( address & 0xFF00 ) >> 8 );
    SpiInOut( address & 0x00FF );
    SpiInOut( 0 );
    for( uint16_t i = 0; i < size; i++ )
    {
        buffer[i] = SpiInOut(0 );
    }

    GPIO_WriteBit( RADIO_NSS_PORT, RADIO_NSS_PIN,Bit_SET);

    SX126xWaitOnBusy( );
#endif    
}

uint8_t SX126xReadRegister( uint16_t address )
{
    uint8_t data = 0;
    SX126xReadRegisters( address, &data, 1 );
    return data;
}

void SX126xWriteBuffer( uint8_t offset, uint8_t *buffer, uint8_t size )
{
#if 0    
    SX126xCheckDeviceReady( );

    GPIO_WriteBit( RADIO_NSS_PORT, RADIO_NSS_PIN,Bit_RESET);
    
    SpiInOut( RADIO_WRITE_BUFFER );
    SpiInOut( offset );
    for( uint16_t i = 0; i < size; i++ )
    {
        SpiInOut( buffer[i] );
    }

    GPIO_WriteBit( RADIO_NSS_PORT, RADIO_NSS_PIN,Bit_SET);

    SX126xWaitOnBusy( );
#endif    
}

void SX126xReadBuffer( uint8_t offset, uint8_t *buffer, uint8_t size )
{
#if 0    
    SX126xCheckDeviceReady( );

    GPIO_WriteBit( RADIO_NSS_PORT, RADIO_NSS_PIN,Bit_RESET);

    SpiInOut(  RADIO_READ_BUFFER );
    SpiInOut(  offset );
    SpiInOut(  0 );
    for( uint16_t i = 0; i < size; i++ )
    {
        buffer[i] = SpiInOut( 0 );
    }

    GPIO_WriteBit( RADIO_NSS_PORT, RADIO_NSS_PIN,Bit_SET);
    
    SX126xWaitOnBusy( );
#endif    
}

void SX126xSetRfTxPower( int8_t power )
{
    SX126xSetTxParams( power, RADIO_RAMP_40_US );
}

uint8_t SX126xGetPaSelect( uint32_t channel )
{

  
  return SX1262;
}

void SX126xAntSwOn( void )
{
    
}

void SX126xAntSwOff( void )
{
  
}

bool SX126xCheckRfFrequency( uint32_t frequency )
{
   
    return true;
}
